app/controllers/songs_controller.rb

  def index
    Song.reindex
    if request.xhr?
      render :json => Song.all.to_json
---
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "my song"], ["artist", "I"], ["created_at", "2016-08-09 21:55:04.570514"], ["updated_at", "2016-08-09 21:55:04.570514"]]